app/views/admin/notifications/index.html.erb


<%=
  if Notification.any?
---
SELECT  1 AS one FROM "notifications" LIMIT ?  [["LIMIT", 1]]