app/controllers/admin/comments_controller.rb

  def index
    if params[:search].present?
      @comments = Comment.matching_fullname_or_message(params[:search]).page params[:page]
    else
      @comments = Comment.where(status: to_bool(params[:status])).page params[:page]
---
SELECT  "comments".* FROM "comments" WHERE "comments"."status" = ? LIMIT ? OFFSET ?  [["status", "t"], ["LIMIT", 25], ["OFFSET", 0]]

  def update
    @comment = Comment.find(params[:id])
    if @comment.update(status: params[:status])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "comments" SET "status" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["status", "t"], ["updated_at", "2017-08-20 13:21:47.890512"], ["id", 6]]