app/controllers/admin/messages_controller.rb

SELECT  "messages".* FROM "messages" ORDER BY "messages"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "messages"
---
  def index
    if params[:search].present?
      @messages = Message.matching_fullname_or_content(params[:search]).page params[:page]

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
---
  def show
    @message = Message.find(params[:id])

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
UPDATE "messages" SET "status" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["status", "f"], ["updated_at", "2017-08-23 02:50:40.871418"], ["id", 28]]
---
  def update
    @message = Message.find(params[:id])
    @message.update(status: params[:status])

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 24]]
---
  def destroy
    @message = Message.find(params[:id])
    @message.destroy