app/controllers/admin/moderators_controller.rb

SELECT "moderators".* FROM "moderators"
---
  def index
    @moderators = Moderator.all

SELECT  "moderators".* FROM "moderators" WHERE "moderators"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @moderator = Moderator.find(params[:id])

SELECT  "moderators".* FROM "moderators" WHERE "moderators"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "moderators" SET "fullname" = ?, "password_digest" = ?, "updated_at" = ? WHERE "moderators"."id" = ?  [["fullname", "David"], ["password_digest", "$2a$10$XqOYs4NnuaYj68GCAaGRC.8aTs2/zva/QLxHUERiQIxkFL4FUEoPu"], ["updated_at", "2017-08-19 06:44:55.398564"], ["id", 1]]
---
  def update
    @moderator = Moderator.find(params[:id])

    if @moderator.update(moderator_params)