app/controllers/admin/notifications_controller.rb

SELECT "notifications".* FROM "notifications" WHERE "notifications"."notifiable_type" = ? ORDER BY "notifications"."id" DESC  [["notifiable_type", "Comment"]]
---
  def index
    @visitor_notifications = Notification.where(notifiable_type: 'Visitor').order(id: :desc)

SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
DELETE FROM "notifications" WHERE "notifications"."id" = ?  [["id", 29]]
---
  def destroy
    @notifiable = Notification.find(params[:id])
    @notifiable.destroy

DELETE FROM "notifications"
---
  def delete_all
    Notification.delete_all