app/controllers/admin/posts_controller.rb

  def index
    if params[:search].present?
      @posts = Post.matching_title_or_content(params[:search]).page params[:page]
---
SELECT  "posts".* FROM "posts" WHERE (title LIKE '%odio%' OR content LIKE '%odio%') LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE (title LIKE '%a%' OR content LIKE '%a%')

  def create
    @post = Post.new(post_params)
    @post.moderator_id = current_moderator.id

    if @post.save
---
INSERT INTO "posts" ("title", "content", "publish", "moderator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "關於球學1"], ["content", "test"], ["publish", "t"], ["moderator_id", 1], ["created_at", "2017-08-19 15:31:47.764201"], ["updated_at", "2017-08-19 15:31:47.764201"]]

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "關於球學2"], ["updated_at", "2017-08-19 16:15:31.905203"], ["id", 32]]