app/controllers/admin/sessions_controller.rb

  def create
    @moderator = Moderator.find_by(username: params[:username]).try(:authenticate, params[:password])
---
SELECT  "moderators".* FROM "moderators" WHERE "moderators"."username" = ? LIMIT ?  [["username", "hungming"], ["LIMIT", 1]]