app/controllers/admin/tags_controller.rb

  def new
    @tag = Tag.new
    @tags = Tag.all.order(id: :desc)
---
SELECT "tags".* FROM "tags" ORDER BY "tags"."id" DESC

  def create
    tags_params[:name].split(',').map do |n|
      Tag.new(name: n).save
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Choxue"], ["created_at", "2017-08-19 18:45:44.891729"], ["updated_at", "2017-08-19 18:45:44.891729"]]

  def edit
    @tag = Tag.find(params[:id])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]

  def update
    @tag = Tag.find(params[:id])
    if @tag.update tags_params
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
UPDATE "tags" SET "name" = ?, "updated_at" = ? WHERE "tags"."id" = ?  [["name", "23"], ["updated_at", "2017-08-20 08:57:52.953752"], ["id", 31]]

  def destroy
    @tag = Tag.find(params[:id])
    @tag.destroy
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 31]]