app/controllers/admin/visitors_controller.rb

SELECT  "visitors".* FROM "visitors" ORDER BY "visitors"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    @visitors = Visitor.all.order(id: :desc).page params[:page]

SELECT  "visitors".* FROM "visitors" WHERE "visitors"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
DELETE FROM "visitors" WHERE "visitors"."id" = ?  [["id", 30]]
---
  def destroy
    @visitor = Visitor.find(params[:id])
    @visitor.destroy