app/views/admin/posts/_form.html.erb

SELECT "tags".* FROM "tags"
---
  <p>
    <%= f.select :tag_ids, Tag.all.collect {|t| [t.name, t.id]}, {prompt: 'Select Tag'}, multiple: :true %><br>